docs/posts/configurar-letsencrypt-en-traefik/index.html
<!DOCTYPE html>
<html><head lang="en">
	<meta charset="utf-8" />
	<meta http-equiv="X-UA-Compatible" content="IE=edge"><title>Configurar Let&#39;s Encrypt en traefik - Blog</title><meta name="viewport" content="width=device-width, initial-scale=1">
	<meta name="description" content="Resumen   En el siguiente articulo veremos como configurar SSL en traefik usando Let&#39;s Encrypt que aunque es fácil este requiere un par de pasos para su puesta en marcha.
 Debido a que es una configuración que requiere varios pasos es posible que cometiera algun error, de ser el caso agradeceria me lo reportaran a mi twitter https://twitter.com/dannywolfmx/
  Configuración de traefik.yml  api: #Habilitar el dashboard de traefik dashboard: true debug: true entryPoints: #Los entry points para http (80) y https (443) http: address: &#34;:80&#34; https: address: &#34;:443&#34; serversTransport: insecureSkipVerify: true providers: docker: endpoint: &#34;unix:///var/run/docker." />
	<meta property="og:image" content=""/>
	<meta property="og:title" content="Configurar Let&#39;s Encrypt en traefik" />
<meta property="og:description" content="Resumen   En el siguiente articulo veremos como configurar SSL en traefik usando Let&#39;s Encrypt que aunque es fácil este requiere un par de pasos para su puesta en marcha.
 Debido a que es una configuración que requiere varios pasos es posible que cometiera algun error, de ser el caso agradeceria me lo reportaran a mi twitter https://twitter.com/dannywolfmx/
  Configuración de traefik.yml  api: #Habilitar el dashboard de traefik dashboard: true debug: true entryPoints: #Los entry points para http (80) y https (443) http: address: &#34;:80&#34; https: address: &#34;:443&#34; serversTransport: insecureSkipVerify: true providers: docker: endpoint: &#34;unix:///var/run/docker." />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://dannywolfmx.github.io/blog/posts/configurar-letsencrypt-en-traefik/" /><meta property="article:section" content="posts" />
<meta property="article:published_time" content="2022-04-03T00:00:20-06:00" />
<meta property="article:modified_time" content="2022-04-03T00:00:20-06:00" />

<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="Configurar Let&#39;s Encrypt en traefik"/>
<meta name="twitter:description" content="Resumen   En el siguiente articulo veremos como configurar SSL en traefik usando Let&#39;s Encrypt que aunque es fácil este requiere un par de pasos para su puesta en marcha.
 Debido a que es una configuración que requiere varios pasos es posible que cometiera algun error, de ser el caso agradeceria me lo reportaran a mi twitter https://twitter.com/dannywolfmx/
  Configuración de traefik.yml  api: #Habilitar el dashboard de traefik dashboard: true debug: true entryPoints: #Los entry points para http (80) y https (443) http: address: &#34;:80&#34; https: address: &#34;:443&#34; serversTransport: insecureSkipVerify: true providers: docker: endpoint: &#34;unix:///var/run/docker."/>
	
	
        <link href="https://dannywolfmx.github.io/blog/css/fonts.2c2227b81b1970a03e760aa2e6121cd01f87c88586803cbb282aa224720a765f.css" rel="stylesheet">
	

	
	<link rel="stylesheet" type="text/css" media="screen" href="https://dannywolfmx.github.io/blog/css/main.ac08a4c9714baa859217f92f051deb58df2938ec352b506df655005dcaf98cc0.css" />
		<link id="darkModeStyle" rel="stylesheet" type="text/css" href="https://dannywolfmx.github.io/blog/css/dark.726cd11ca6eb7c4f7d48eb420354f814e5c1b94281aaf8fd0511c1319f7f78a4.css"  disabled />
	

	
	

	
	
	
	
</head>
<body>
        <div class="content"><header>
	<div class="main">
		<a href="https://dannywolfmx.github.io/blog/">Blog</a>
	</div>
	<nav>
		
		| <span id="dark-mode-toggle" onclick="toggleTheme()"></span>
		<script src="https://dannywolfmx.github.io/blog/js/themetoggle.js"></script>
		
	</nav>
</header>

<main>
	<article>
		<div class="title">
			<h1 class="title">Configurar Let&#39;s Encrypt en traefik</h1>
			<div class="meta">Posted on Apr 3, 2022</div>
		</div>
		

		<section class="body">
			
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Resumen
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
En el siguiente articulo veremos como configurar SSL en traefik usando Let&#39;s Encrypt que aunque es fácil este requiere un par de pasos para su puesta en marcha.</p>
<p>
Debido a que es una configuración que requiere varios pasos es posible que cometiera algun error, de ser el caso agradeceria me lo reportaran a mi twitter  <a href="https://twitter.com/dannywolfmx/">https://twitter.com/dannywolfmx/</a></p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Configuración de traefik.yml
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<div class="src src-yaml">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-yaml" data-lang="yaml"><span style="color:#f92672">api</span>:
  <span style="color:#75715e">#Habilitar el dashboard de traefik</span>
  <span style="color:#f92672">dashboard</span>: <span style="color:#66d9ef">true</span>
  <span style="color:#f92672">debug</span>: <span style="color:#66d9ef">true</span>
<span style="color:#f92672">entryPoints</span>:
  <span style="color:#75715e">#Los entry points para http (80) y https (443)</span>
  <span style="color:#f92672">http</span>:
    <span style="color:#f92672">address</span>: <span style="color:#e6db74">&#34;:80&#34;</span>
  <span style="color:#f92672">https</span>:
    <span style="color:#f92672">address</span>: <span style="color:#e6db74">&#34;:443&#34;</span>
<span style="color:#f92672">serversTransport</span>:
  <span style="color:#f92672">insecureSkipVerify</span>: <span style="color:#66d9ef">true</span>
<span style="color:#f92672">providers</span>:
  <span style="color:#f92672">docker</span>:
    <span style="color:#f92672">endpoint</span>: <span style="color:#e6db74">&#34;unix:///var/run/docker.sock&#34;</span>
    <span style="color:#f92672">exposedByDefault</span>: <span style="color:#66d9ef">false</span>
  <span style="color:#f92672">file</span>:
    <span style="color:#f92672">filename</span>: <span style="color:#ae81ff">/config.yml</span>
<span style="color:#f92672">certificatesResolvers</span>:
  <span style="color:#75715e">#nombre de nuestro resolver, este puede ser el nombre que quieras, por comodidas le he puestro el siguiente</span>
  <span style="color:#f92672">letsencrypt</span>:
    <span style="color:#75715e">#los datos ligados a nuestro</span>
    <span style="color:#f92672">acme</span>:
      <span style="color:#f92672">email</span>: <span style="color:#ae81ff">nuestro_email@nuestro_dominio.com</span>
      <span style="color:#f92672">storage</span>: <span style="color:#ae81ff">acme.json</span>
      <span style="color:#f92672">dnsChallenge</span>:
        <span style="color:#f92672">provider</span>: <span style="color:#ae81ff">linodev4</span>
        <span style="color:#f92672">resolvers</span>:
          - <span style="color:#e6db74">&#34;1.1.1.1:53&#34;</span>
          - <span style="color:#e6db74">&#34;1.0.0.1:53&#34;</span></code></pre></div>
</div>
<p>
Como notaremos tenemos indicado la existencia de un archivo llamado <strong>acme.json</strong>, es importante crearlo y que este tenga permiso 600</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-bash" data-lang="bash">touch acme.json
chmod <span style="color:#ae81ff">600</span> acme.json</code></pre></div>
</div>
<p>
Un punto importante es identificar el <strong>provider</strong> al cual Let&#39;s Encrypt se conectará, en la documentación podemos encontrar la lista de proveedores <a href="https://doc.traefik.io/traefik/https/acme/#providers">Let&#39;s Encrypt - Traefik</a>. Lamentablemente traefik no es del todo claro cuando hemos seleccionado adecuadamente nuestro proveedor, y no nos arrojara un error que nos brindé luz sobre cual es el problema. En mi caso en particular que estoy utilizando linode, traefik cuanta con 2 formas de configurar una cuenta de linode, y por desgracia demoré en darme cuenta que la mía debía ser <strong>linodev4</strong></p>
<p>
Como notaremos en la documentación, traefik por debajo utiliza LEGO un cliente para interactuar con Let&#39;s Encrypt y que nos será de utilidad para saber como configurar nuestro cliente en base al provider.</p>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Ejemplo de Linode V4
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>
<a href="https://go-acme.github.io/lego/dns/linode/">Linode (v4) :: Let’s Encrypt client and ACME library written in Go.</a></p>
<p>
En la documentación de Lego encontraremos algo como lo siguiente:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-bash" data-lang="bash">LINODE_TOKEN<span style="color:#f92672">=</span>xxxxx <span style="color:#ae81ff">\
</span><span style="color:#ae81ff"></span>lego --email myemail@example.com --dns linode --domains my.example.org run</code></pre></div>
</div>
<p>
Pero debido a que traefik es quien se encargará de hacer la interacción con Lego debemos ajustar el anterior comando para que traefik sea quien haga de forma interna este comando.</p>
<p>
<strong>LINODE_TOKEN:</strong> este token lo debemos de conseguir desde nuestro panel de control dentro de linode  <a href="https://cloud.linode.com/profile/tokens">Linode Manager</a>, dentro del panel generaremos un nuevo <strong>Personal Access Token</strong> y le daremos únicamente permisos para poder leer y escribir dominios. (Mas adelante veremos donde colocar este token).</p>
<p>
<strong>email:</strong> este ya lo hemos indicado en nuestro <strong>traefik.yml</strong> en el apartado de email de acme, por lo que no es necesario modificar nada.</p>
<p>
<strong>dns:</strong> este ya lo hemos indicado en los parametros de nuestro dnsChallenge en el archivo <strong>traefik.yml</strong>.</p>
<p>
En caso de que se lo pregunten, es correcto los resolvers son las IPs publicas de cloudflare para sus DNS, pero no se preocupen dado que son validos como remplazo a los de linode.</p>
</div>
</div>
</div>
</div>
