content/posts/configurar-letsencrypt-en-traefik.org
* Configuración del contenedor de traefik usando docker-compose
#+begin_src yaml
version: '3.4'

services:
  traefik:
    container_name: traefik
    restart: unless-stopped
    image: traefik:v2.1
    networks:
      - proxy
    ports:
      - "80:80"
      - "443:443"
    environment:
      - LINODE_TOKEN=AQUI PONDREMOS EL TOKEN QUE GENERAMOS ANTES
    volumes:
      - /var/run/docker.sock:/var/run/docker.sock:ro
      - ./data/traefik.yml:/traefik.yml:ro
      - ./data/config.yml:/config.yml:ro
      - ./data/acme.json:/acme.json
    labels:
      - "traefik.enable=true"


      - "traefik.http.routers.traefik.entrypoints=http"
      - "traefik.http.routers.traefik.rule=Host(`traefik.example.com`)"

      - "traefik.http.middlewares.https-redirect.redirectscheme.scheme=https"
      - "traefik.http.middlewares.sslheader.headers.customrequestheaders.X-Forwarded-Proto=https"

      - "traefik.http.routers.traefik.middlewares=https-redirect"

      - "traefik.http.routers.traefik-secure.entrypoints=https"
      - "traefik.http.routers.traefik-secure.rule=Host(`traefik.example.com`)"

      #user password
      - "traefik.http.middlewares.auth.basicauth.users=user:$$apr1$$ZCdpObME$$JUZ7NMS93R/k54WEYpek80"
      - "traefik.http.routers.traefik-secure.middlewares=auth"

      - "traefik.http.routers.traefik-secure.tls=true"
      - "traefik.http.routers.traefik-secure.tls.certresolver=letsencrypt"
      - "traefik.http.routers.traefik-secure.tls.domains[0].main=example.com"
      - "traefik.http.routers.traefik-secure.tls.domains[0].sans=*.example.com"

      - "traefik.http.routers.traefik-secure.service=api@internal"


networks:
  proxy:
    external: true
#+end_src

** Volúmenes
Para entender los volúmenes de mejor forma este es mi estructura de archivos para este contenedor:
#+begin_src bash
+ docker-compose.yml
- data
    | - acme.json
    | - config.yml //este no lo utilizaremos en este tutorial pero puedes crearlo para futuros usos
    | - traefik.yml
#+end_src

Como tal todos los volúmenes serán de tipo read-only *ro* menos el de acme.json debido a que traefik escribirá y leerá de este archivo para almacenar la información generada por Lego.

** Network

Definimos nuestra network llamada *proxy* en el docker-compose. No es necesario que se llame *proxy* puede ponerle el nombre que consideres mejor para tu proyecto
#+begin_src yaml
services:
  traefik:
    networks:
      - proxy
#+end_src

Y de igual forma dentro de nuestro servicio traefik indicamos las redes a la cual podrá estar conectado nuestro traefik, en este caso solo será a *proxy*

#+begin_src yaml
networks:
  - proxy
#+end_src

Creación de nuestra red llamada *proxy* en nuestra shell

#+begin_src bash
docker network create proxy
#+end_src

** LINODE_TOKEN

Este apartado variará dependiendo de nuestro proveedor, por lo que vale la pena consultemos en la documentación [[https://doc.traefik.io/traefik/https/acme/][Let's Encrypt - Traefik]] y en prestar atención a la columna *Enviroment Variables* que en mi caso solo requiere la LINODE_TOKEN, y por ejemplo las de cloudflare son CF_API_EMAIL, CF_API_KEY

#+begin_src yaml
services:
  traefik:
    environment:
      - LINODE_TOKEN=AQUI PONDREMOS EL TOKEN QUE GENERAMOS ANTES
#+end_src

** Ports

Hacemos un mapeo de nuestros puertos 80 y 443 para que sean utilizados por los protocolos http y https respectivamente

#+begin_src yaml
    ports:
      - "80:80"
      - "443:443"
#+end_src

** Labels
*** traefik.enable=true
Le indicamos a traefik que este contenedor hará uso de traefik.

¿Cual es el motivo de que traefik utilice traefik? esto es debido a que como tal quien hara uso de traefik es realmente el dashboard de traefik, el cual hemos activado con motivo de tener una mejor visualización de si nuestros servicios están corriendo de buena forma.

*** traefik.http.middleware
**** https-redirect.redirectscheme.scheme
Le pedimos a traefik que haga un redirect de las request al esquema https
**** sslheader.headers.customrequestheaders.X-Forwarded-Proto
CustomRequestHeaders revela una lista de opciones para aplicar a una request, en este caso agregaremos la X-Forwarded-Proto, este nos ayudará a identificar entre http y https  [[https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Forwarded-Proto][X-Forwarded-Proto - HTTP | MDN]]
