docs/posts/configurar-letsencrypt-en-traefik/index.html
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
Configuración del contenedor de traefik usando docker-compose
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<div class="src src-yaml">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-yaml" data-lang="yaml"><span style="color:#f92672">version</span>: <span style="color:#e6db74">&#39;3.4&#39;</span>

<span style="color:#f92672">services</span>:
  <span style="color:#f92672">traefik</span>:
    <span style="color:#f92672">container_name</span>: <span style="color:#ae81ff">traefik</span>
    <span style="color:#f92672">restart</span>: <span style="color:#ae81ff">unless-stopped</span>
    <span style="color:#f92672">image</span>: <span style="color:#ae81ff">traefik:v2.1</span>
    <span style="color:#f92672">networks</span>:
      - <span style="color:#ae81ff">proxy</span>
    <span style="color:#f92672">ports</span>:
      - <span style="color:#e6db74">&#34;80:80&#34;</span>
      - <span style="color:#e6db74">&#34;443:443&#34;</span>
    <span style="color:#f92672">environment</span>:
      - <span style="color:#ae81ff">LINODE_TOKEN=AQUI PONDREMOS EL TOKEN QUE GENERAMOS ANTES</span>
    <span style="color:#f92672">volumes</span>:
      - <span style="color:#ae81ff">/var/run/docker.sock:/var/run/docker.sock:ro</span>
      - <span style="color:#ae81ff">./data/traefik.yml:/traefik.yml:ro</span>
      - <span style="color:#ae81ff">./data/config.yml:/config.yml:ro</span>
      - <span style="color:#ae81ff">./data/acme.json:/acme.json</span>
    <span style="color:#f92672">labels</span>:
      - <span style="color:#e6db74">&#34;traefik.enable=true&#34;</span>


      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik.entrypoints=http&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik.rule=Host(`traefik.example.com`)&#34;</span>

      - <span style="color:#e6db74">&#34;traefik.http.middlewares.https-redirect.redirectscheme.scheme=https&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.middlewares.sslheader.headers.customrequestheaders.X-Forwarded-Proto=https&#34;</span>

      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik.middlewares=https-redirect&#34;</span>

      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.entrypoints=https&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.rule=Host(`traefik.example.com`)&#34;</span>

      <span style="color:#75715e">#user password</span>
      - <span style="color:#e6db74">&#34;traefik.http.middlewares.auth.basicauth.users=user:$$apr1$$ZCdpObME$$JUZ7NMS93R/k54WEYpek80&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.middlewares=auth&#34;</span>

      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.tls=true&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.tls.certresolver=letsencrypt&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.tls.domains[0].main=example.com&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.tls.domains[0].sans=*.example.com&#34;</span>

      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.service=api@internal&#34;</span>


<span style="color:#f92672">networks</span>:
  <span style="color:#f92672">proxy</span>:
    <span style="color:#f92672">external</span>: <span style="color:#66d9ef">true</span></code></pre></div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Volúmenes
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>Para entender los volúmenes de mejor forma este es mi estructura de archivos para este contenedor:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-bash" data-lang="bash">+ docker-compose.yml
- data
    | - acme.json
    | - config.yml //este no lo utilizaremos en este tutorial pero puedes crearlo para futuros usos
    | - traefik.yml</code></pre></div>
</div>
<p>
Como tal todos los volúmenes serán de tipo read-only <strong>ro</strong> menos el de acme.json debido a que traefik escribirá y leerá de este archivo para almacenar la información generada por Lego.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Network
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>
Definimos nuestra network llamada <strong>proxy</strong> en el docker-compose. No es necesario que se llame <strong>proxy</strong> puede ponerle el nombre que consideres mejor para tu proyecto</p>
<div class="src src-yaml">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-yaml" data-lang="yaml"><span style="color:#f92672">services</span>:
  <span style="color:#f92672">traefik</span>:
    <span style="color:#f92672">networks</span>:
      - <span style="color:#ae81ff">proxy</span></code></pre></div>
</div>
<p>
Y de igual forma dentro de nuestro servicio traefik indicamos las redes a la cual podrá estar conectado nuestro traefik, en este caso solo será a <strong>proxy</strong></p>
<div class="src src-yaml">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-yaml" data-lang="yaml"><span style="color:#f92672">networks</span>:
  - <span style="color:#ae81ff">proxy</span></code></pre></div>
</div>
<p>
Creación de nuestra red llamada <strong>proxy</strong> en nuestra shell</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-bash" data-lang="bash">docker network create proxy</code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
LINODE_TOKEN
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>
Este apartado variará dependiendo de nuestro proveedor, por lo que vale la pena consultemos en la documentación <a href="https://doc.traefik.io/traefik/https/acme/">Let&#39;s Encrypt - Traefik</a> y en prestar atención a la columna <strong>Enviroment Variables</strong> que en mi caso solo requiere la LINODE_TOKEN, y por ejemplo las de cloudflare son CF_API_EMAIL, CF_API_KEY</p>
<div class="src src-yaml">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-yaml" data-lang="yaml"><span style="color:#f92672">services</span>:
  <span style="color:#f92672">traefik</span>:
    <span style="color:#f92672">environment</span>:
      - <span style="color:#ae81ff">LINODE_TOKEN=AQUI PONDREMOS EL TOKEN QUE GENERAMOS ANTES</span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Ports
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>
Hacemos un mapeo de nuestros puertos 80 y 443 para que sean utilizados por los protocolos http y https respectivamente</p>
<div class="src src-yaml">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-yaml" data-lang="yaml">    <span style="color:#f92672">ports</span>:
      - <span style="color:#e6db74">&#34;80:80&#34;</span>
      - <span style="color:#e6db74">&#34;443:443&#34;</span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
Labels
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<div id="outline-container-headline-10" class="outline-4">
<h4 id="headline-10">
traefik.enable=true
</h4>
<div id="outline-text-headline-10" class="outline-text-4">
<p>Le indicamos a traefik que este contenedor hará uso de traefik.</p>
<p>
¿Cual es el motivo de que traefik utilice traefik? esto es debido a que como tal quien hara uso de traefik es realmente el dashboard de traefik, el cual hemos activado con motivo de tener una mejor visualización de si nuestros servicios están corriendo de buena forma.</p>
</div>
</div>
<div id="outline-container-headline-11" class="outline-4">
<h4 id="headline-11">
traefik.http.middleware
</h4>
<div id="outline-text-headline-11" class="outline-text-4">
<div id="outline-container-headline-12" class="outline-5">
<h5 id="headline-12">
https-redirect.redirectscheme.scheme
</h5>
<div id="outline-text-headline-12" class="outline-text-5">
<p>Le pedimos a traefik que haga un redirect de las request al esquema https</p>
</div>
</div>
<div id="outline-container-headline-13" class="outline-5">
<h5 id="headline-13">
sslheader.headers.customrequestheaders.X-Forwarded-Proto
</h5>
<div id="outline-text-headline-13" class="outline-text-5">
<p>CustomRequestHeaders revela una lista de opciones para aplicar a una request, en este caso agregaremos la X-Forwarded-Proto, este nos ayudará a identificar entre http y https  <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Forwarded-Proto">X-Forwarded-Proto - HTTP | MDN</a></p>
</div>
</div>
