content/posts/configurar-letsencrypt-en-traefik.org
**** auth.basicauth.users
Traefik nos brinda mecanismos para solicitar un usuario y contraseña utilizando la api nativas de los navegadores, y este nos será útil para tener un control de acceso al dashboard de traefik,

Lo siguiente es el equivalente a tener como usuario *user* y tener como contraseña *password*
#+begin_src bash
user:$$apr1$$ZCdpObME$$JUZ7NMS93R/k54WEYpek80
#+end_src

Para generar un sistema de usuario contraseña para traefik requerimos utilizar el programa htpasswd del proyecto apache. Una vez instalado en nuestro PC podemos generar nuestro usuario y contraseña:

#+begin_src bash
echo $(htpasswd -nb user password) | sed -e s/\\$/\\$\\$/g
#+end_src


sustituimos el *user* y *password* por el nombre que consideremos bueno

Nota: es muy importante utilizar la sed como se muestra en el apartado anterior

Es importante indicar que esta cadena es casi random su resultado, por lo que no esperes conseguir el mismo resultado que yo

Ahora el resultado lo colocamos en nuestro contenedor y listo.

Nota: Recomendaría considerar colocar este dato en una variable de entorno

*** traefik.http.routers
**** traefik
En este caso podemos hacer referencia a nuestro propio contenedor utilizando su propio indicado en el *container_name* de nuestro docker-compose.

***** entryPoints
Este lo especificamos previamente en nuestro archivo *traefik.yml* y como se indica sera para atender las peticiones del puerto 80

***** rule
¿Que Host o Path atenderá este contenedor?, en este caso el dashboard sera desplegado en la pagina traefik.example.com, el cual debemos sustituir por uno que pertenezca a nuestro dominio.


#+begin_src yaml
    labels:
      - "traefik.enable=true"


      - "traefik.http.routers.traefik.entrypoints=http"
      - "traefik.http.routers.traefik.rule=Host(`traefik.example.com`)"

      - "traefik.http.middlewares.https-redirect.redirectscheme.scheme=https"
      - "traefik.http.middlewares.sslheader.headers.customrequestheaders.X-Forwarded-Proto=https"

      - "traefik.http.routers.traefik.middlewares=https-redirect"

      - "traefik.http.routers.traefik-secure.entrypoints=https"
      - "traefik.http.routers.traefik-secure.rule=Host(`traefik.example.com`)"

      #user password
      - "traefik.http.middlewares.auth.basicauth.users=user:$$apr1$$ZCdpObME$$JUZ7NMS93R/k54WEYpek80"
      - "traefik.http.routers.traefik-secure.middlewares=auth"

      - "traefik.http.routers.traefik-secure.tls=true"
      - "traefik.http.routers.traefik-secure.tls.certresolver=letsencrypt"
      - "traefik.http.routers.traefik-secure.tls.domains[0].main=example.com"
      - "traefik.http.routers.traefik-secure.tls.domains[0].sans=*.example.com"

      - "traefik.http.routers.traefik-secure.service=api@internal"
#+end_src

***** middlewares
Asignamos el middleware *https-redirect* que declaramos con anterioridad, este nos ayudara a redirigir las peticiones http al https

**** traefik-secure
Con traefik podemos colocar el nombre de servicio que queramos en nuestro contenedor, no es necesario que sea el mismo que el *container_name* y utilizaremos esta característica para crear un nuevo servicio que administrara los entrypoints de tipo https.

Algunos puntos son similares a los http por lo que omitiré su explicación

***** middlewares
Agregamos el middleware auth a nuestro traefik seguro con motivo de que se le solicite el usuario y contraseña a los usuarios que quieran acceder al dashboard

***** tls
Por ultimo indicamos con *true* que deseamos utilizar tls para esta conexión.

*certresolver:* Es el nombre que indicamos en nuestro archivo *traefik.yml* en mi caso para identificarlo de mejor forma le llamé letsencrypt, pero repito puedes llamarle como gustes

*domains[0].main:* Este sera nuestro dominio principal del cual también indicaremos los sub-dominios

*domains[0].sans:* Los sub-dominios que deseamos incluir ssl, en mi caso deseo que todos los sub-dominios tengan ssl así que podemos usar el * como comodín

***** service
utilizaremos el servicio api declarado en *traefik.yml*

**** Puesta en marcha de traefik

Tras lo anterior ahora ya podemos arrancar nuestro docker-compose

Es recomendable hacer un simple *up* para visualizar si traefik tiene algún mensaje de error.
#+begin_src bash
docker-compose up
#+end_src

Ahora debemos ser capaces de entrar a traefik.example.com y nuestro navegador nos indicará que el https esta activo y correctamente configurado

