docs/posts/configurar-letsencrypt-en-traefik/index.html
<div id="outline-container-headline-14" class="outline-5">
<h5 id="headline-14">
auth.basicauth.users
</h5>
<div id="outline-text-headline-14" class="outline-text-5">
<p>Traefik nos brinda mecanismos para solicitar un usuario y contraseña utilizando la api nativas de los navegadores, y este nos será útil para tener un control de acceso al dashboard de traefik,</p>
<p>
Lo siguiente es el equivalente a tener como usuario <strong>user</strong> y tener como contraseña <strong>password</strong></p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-bash" data-lang="bash">user:$$apr1$$ZCdpObME$$JUZ7NMS93R/k54WEYpek80</code></pre></div>
</div>
<p>
Para generar un sistema de usuario contraseña para traefik requerimos utilizar el programa htpasswd del proyecto apache. Una vez instalado en nuestro PC podemos generar nuestro usuario y contraseña:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-bash" data-lang="bash">echo <span style="color:#66d9ef">$(</span>htpasswd -nb user password<span style="color:#66d9ef">)</span> | sed -e s/<span style="color:#ae81ff">\\</span>$/<span style="color:#ae81ff">\\</span>$<span style="color:#ae81ff">\\</span>$/g</code></pre></div>
</div>
<p>
sustituimos el <strong>user</strong> y <strong>password</strong> por el nombre que consideremos bueno</p>
<p>
Nota: es muy importante utilizar la sed como se muestra en el apartado anterior</p>
<p>
Es importante indicar que esta cadena es casi random su resultado, por lo que no esperes conseguir el mismo resultado que yo</p>
<p>
Ahora el resultado lo colocamos en nuestro contenedor y listo.</p>
<p>
Nota: Recomendaría considerar colocar este dato en una variable de entorno</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-15" class="outline-4">
<h4 id="headline-15">
traefik.http.routers
</h4>
<div id="outline-text-headline-15" class="outline-text-4">
<div id="outline-container-headline-16" class="outline-5">
<h5 id="headline-16">
traefik
</h5>
<div id="outline-text-headline-16" class="outline-text-5">
<p>En este caso podemos hacer referencia a nuestro propio contenedor utilizando su propio indicado en el <strong>container_name</strong> de nuestro docker-compose.</p>
<div id="outline-container-headline-17" class="outline-6">
<h6 id="headline-17">
entryPoints
</h6>
<div id="outline-text-headline-17" class="outline-text-6">
<p>Este lo especificamos previamente en nuestro archivo <strong>traefik.yml</strong> y como se indica sera para atender las peticiones del puerto 80</p>
</div>
</div>
<div id="outline-container-headline-18" class="outline-6">
<h6 id="headline-18">
rule
</h6>
<div id="outline-text-headline-18" class="outline-text-6">
<p>¿Que Host o Path atenderá este contenedor?, en este caso el dashboard sera desplegado en la pagina traefik.example.com, el cual debemos sustituir por uno que pertenezca a nuestro dominio.</p>
<div class="src src-yaml">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-yaml" data-lang="yaml">    <span style="color:#f92672">labels</span>:
      - <span style="color:#e6db74">&#34;traefik.enable=true&#34;</span>


      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik.entrypoints=http&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik.rule=Host(`traefik.example.com`)&#34;</span>

      - <span style="color:#e6db74">&#34;traefik.http.middlewares.https-redirect.redirectscheme.scheme=https&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.middlewares.sslheader.headers.customrequestheaders.X-Forwarded-Proto=https&#34;</span>

      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik.middlewares=https-redirect&#34;</span>

      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.entrypoints=https&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.rule=Host(`traefik.example.com`)&#34;</span>

      <span style="color:#75715e">#user password</span>
      - <span style="color:#e6db74">&#34;traefik.http.middlewares.auth.basicauth.users=user:$$apr1$$ZCdpObME$$JUZ7NMS93R/k54WEYpek80&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.middlewares=auth&#34;</span>

      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.tls=true&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.tls.certresolver=letsencrypt&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.tls.domains[0].main=example.com&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.tls.domains[0].sans=*.example.com&#34;</span>

      - <span style="color:#e6db74">&#34;traefik.http.routers.traefik-secure.service=api@internal&#34;</span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-19" class="outline-6">
<h6 id="headline-19">
middlewares
</h6>
<div id="outline-text-headline-19" class="outline-text-6">
<p>Asignamos el middleware <strong>https-redirect</strong> que declaramos con anterioridad, este nos ayudara a redirigir las peticiones http al https</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-20" class="outline-5">
<h5 id="headline-20">
traefik-secure
</h5>
<div id="outline-text-headline-20" class="outline-text-5">
<p>Con traefik podemos colocar el nombre de servicio que queramos en nuestro contenedor, no es necesario que sea el mismo que el <strong>container_name</strong> y utilizaremos esta característica para crear un nuevo servicio que administrara los entrypoints de tipo https.</p>
<p>
Algunos puntos son similares a los http por lo que omitiré su explicación</p>
<div id="outline-container-headline-21" class="outline-6">
<h6 id="headline-21">
middlewares
</h6>
<div id="outline-text-headline-21" class="outline-text-6">
<p>Agregamos el middleware auth a nuestro traefik seguro con motivo de que se le solicite el usuario y contraseña a los usuarios que quieran acceder al dashboard</p>
</div>
</div>
<div id="outline-container-headline-22" class="outline-6">
<h6 id="headline-22">
tls
</h6>
<div id="outline-text-headline-22" class="outline-text-6">
<p>Por ultimo indicamos con <strong>true</strong> que deseamos utilizar tls para esta conexión.</p>
<p>
<strong>certresolver:</strong> Es el nombre que indicamos en nuestro archivo <strong>traefik.yml</strong> en mi caso para identificarlo de mejor forma le llamé letsencrypt, pero repito puedes llamarle como gustes</p>
<p>
<strong>domains[0].main:</strong> Este sera nuestro dominio principal del cual también indicaremos los sub-dominios</p>
<p>
<strong>domains[0].sans:</strong> Los sub-dominios que deseamos incluir ssl, en mi caso deseo que todos los sub-dominios tengan ssl así que podemos usar el * como comodín</p>
</div>
</div>
<div id="outline-container-headline-23" class="outline-6">
<h6 id="headline-23">
service
</h6>
<div id="outline-text-headline-23" class="outline-text-6">
<p>utilizaremos el servicio api declarado en <strong>traefik.yml</strong></p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-24" class="outline-5">
<h5 id="headline-24">
Puesta en marcha de traefik
</h5>
<div id="outline-text-headline-24" class="outline-text-5">
<p>
Tras lo anterior ahora ya podemos arrancar nuestro docker-compose</p>
<p>
Es recomendable hacer un simple <strong>up</strong> para visualizar si traefik tiene algún mensaje de error.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-bash" data-lang="bash">docker-compose up</code></pre></div>
</div>
<p>
Ahora debemos ser capaces de entrar a traefik.example.com y nuestro navegador nos indicará que el https esta activo y correctamente configurado</p>
</div>
</div>
</div>
</div>
</div>
</div>
