content/posts/configurar-letsencrypt-en-traefik.org
** Configuración de otros contenedores para usar traefik y asignar dominio o sub-dominio

Este ejemplo es un simple contenedor que corre una aplicación web con el puerto 80 expuesto, por lo que no entraremos en muchos detalles sobre su funcionamiento.

docker-compose.yml:
#+begin_src yaml
services:
  app:
    container_name: app
    build:
      dockerfile: Dockerfile
      context: .
    restart: unless-stopped
    networks:
      - proxy
    labels:
      - "traefik.enable=true"
      - "traefik.http.routers.app.entrypoints=http"
      - "traefik.http.routers.app.rule=Host(`subdominio.example.com`)"

      - "traefik.http.middlewares.app-https-redirect.redirectscheme.scheme=https"
      - "traefik.http.routers.app.middlewares=app-https-redirect"

      - "traefik.http.routers.app-secure.entrypoints=https"
      - "traefik.http.routers.app-secure.rule=Host(`subdominio.example.com`)"
      - "traefik.http.routers.app-secure.tls=true"
      - "traefik.http.routers.app-secure.service=app"
      - "traefik.http.services.app.loadbalancer.server.port=80"
      - "traefik.docker.network=proxy"

networks:
  proxy:
    external: true
#+end_src

Como notaremos guarda mucha similitud al la configuración que le dimos a al dashboard de traefik. Quizás lo mas llamativo es el tema de que se le tiene que indicar el puerto en el que esta corriendo nuestro contenedor para que funcione la versión https, pero en el resto es lo mismo que vimos anteriormente

Ahora podemos correr nuestro contenedor en el fondo, debido a que si existe un error en la configuración de los labels de traefik, este no nos indicará nada, pero quien si nos puede indicar es el dashboard de traefik, o en ultima instancia podemos apagar traefik y validar los logs al volver a encender (Aunque lo mas óptimo sea visualizar los logs sin apagar el contenedor de traefik).


#+begin_src bash
docker-compose up -d
#+end_src

Con esto ya nuestra nueva aplicación que corre en *subdominio.example.com* tendrá un certificado valido.


** Referencias que utilice para hacer este articulo:

En gran medida esta configuración proviene de este vídeo:
[[https://www.youtube.com/watch?v=liV3c9m_OX8][Put Wildcard Certificates and SSL on EVERYTHING - Traefik Tutorial - YouTube]]

Algunas dudas sobre la configuración de linode vienen de este link:
[[https://lefthandbrain.com/lets-encrypt-certificates-with-traefik-on-linode/][Lets Encrypt Certificates with Traefik on Linode]]

Y por ultimo la propia documentación de traefik
[[https://doc.traefik.io/traefik/https/acme/][Let's Encrypt - Traefik]]
