docs/posts/configurar-letsencrypt-en-traefik/index.html
<div id="outline-container-headline-25" class="outline-3">
<h3 id="headline-25">
Configuración de otros contenedores para usar traefik y asignar dominio o sub-dominio
</h3>
<div id="outline-text-headline-25" class="outline-text-3">
<p>
Este ejemplo es un simple contenedor que corre una aplicación web con el puerto 80 expuesto, por lo que no entraremos en muchos detalles sobre su funcionamiento.</p>
<p>
docker-compose.yml:</p>
<div class="src src-yaml">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-yaml" data-lang="yaml"><span style="color:#f92672">services</span>:
  <span style="color:#f92672">app</span>:
    <span style="color:#f92672">container_name</span>: <span style="color:#ae81ff">app</span>
    <span style="color:#f92672">build</span>:
      <span style="color:#f92672">dockerfile</span>: <span style="color:#ae81ff">Dockerfile</span>
      <span style="color:#f92672">context</span>: <span style="color:#ae81ff">.</span>
    <span style="color:#f92672">restart</span>: <span style="color:#ae81ff">unless-stopped</span>
    <span style="color:#f92672">networks</span>:
      - <span style="color:#ae81ff">proxy</span>
    <span style="color:#f92672">labels</span>:
      - <span style="color:#e6db74">&#34;traefik.enable=true&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.app.entrypoints=http&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.app.rule=Host(`subdominio.example.com`)&#34;</span>

      - <span style="color:#e6db74">&#34;traefik.http.middlewares.app-https-redirect.redirectscheme.scheme=https&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.app.middlewares=app-https-redirect&#34;</span>

      - <span style="color:#e6db74">&#34;traefik.http.routers.app-secure.entrypoints=https&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.app-secure.rule=Host(`subdominio.example.com`)&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.app-secure.tls=true&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.routers.app-secure.service=app&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.http.services.app.loadbalancer.server.port=80&#34;</span>
      - <span style="color:#e6db74">&#34;traefik.docker.network=proxy&#34;</span>

<span style="color:#f92672">networks</span>:
  <span style="color:#f92672">proxy</span>:
    <span style="color:#f92672">external</span>: <span style="color:#66d9ef">true</span></code></pre></div>
</div>
<p>
Como notaremos guarda mucha similitud al la configuración que le dimos a al dashboard de traefik. Quizás lo mas llamativo es el tema de que se le tiene que indicar el puerto en el que esta corriendo nuestro contenedor para que funcione la versión https, pero en el resto es lo mismo que vimos anteriormente</p>
<p>
Ahora podemos correr nuestro contenedor en el fondo, debido a que si existe un error en la configuración de los labels de traefik, este no nos indicará nada, pero quien si nos puede indicar es el dashboard de traefik, o en ultima instancia podemos apagar traefik y validar los logs al volver a encender (Aunque lo mas óptimo sea visualizar los logs sin apagar el contenedor de traefik).</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-bash" data-lang="bash">docker-compose up -d</code></pre></div>
</div>
<p>
Con esto ya nuestra nueva aplicación que corre en <strong>subdominio.example.com</strong> tendrá un certificado valido.</p>
</div>
</div>
<div id="outline-container-headline-26" class="outline-3">
<h3 id="headline-26">
Referencias que utilice para hacer este articulo:
</h3>
<div id="outline-text-headline-26" class="outline-text-3">
<p>
En gran medida esta configuración proviene de este vídeo:
<a href="https://www.youtube.com/watch?v=liV3c9m_OX8">Put Wildcard Certificates and SSL on EVERYTHING - Traefik Tutorial - YouTube</a></p>
<p>
Algunas dudas sobre la configuración de linode vienen de este link:
<a href="https://lefthandbrain.com/lets-encrypt-certificates-with-traefik-on-linode/">Lets Encrypt Certificates with Traefik on Linode</a></p>
<p>
Y por ultimo la propia documentación de traefik
<a href="https://doc.traefik.io/traefik/https/acme/">Let&#39;s Encrypt - Traefik</a></p>
</div>
</div>
</div>
</div>

		</section>

		<div class="post-tags">
			
			
			
		</div>
		</article>
</main>
<footer>
  <div style="display:flex"></div>
  <div class="footer-info">
    2023  <a
      href="https://github.com/athul/archie">Archie Theme</a> | Built with <a href="https://gohugo.io">Hugo</a>
  </div>
</footer>


</div>
    </body>
</html>
